Revit 2026 API

# MasonryCMUMasonryCMUColor Property

---

The property labeled "Color" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUColor { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUColor As String
	Get
```
```cpp
public:
static property String^ MasonryCMUColor {
	String^ get ();
}
```
```fsharp
static member MasonryCMUColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace